// glossaryData.ts
import Glossary from './Glossary';

const glossaryData: Glossary[] = [
  {
    word: 'Резонатор',
    meaning: 'Пристрій, який має резонансні властивості, тобто відклик якого на коливання певних частот сильніший, ніж на коливання з іншими частотами. Зазвичай резонатори — просторові розподілені системи, в яких можуть збуджуватися стоячі хвилі. Резонатори мають широке використання в різних областях техніки. Важливе значення вони відіграють у музиці, оскільки чимало музичних інструментів використовують резонатори для підсилення інтенсивності звуку. Порожнини, що виконують роль акустичних резонаторів є у скрипок, гітар, кобз, бандур, ударних інструментів тощо.',
    link: 'Kalimba'
  },
  {
    word: 'Мундштук',
    meaning: 'У контексті музичного інструмента казу, слово "мундштук" означає ту частину інструмента, до якої музикант прикладає губи і через яку він вдуває повітря. Мундштук казу зазвичай має форму трубки або воронки, через яку користувач вдуває повітря і створює звуки, мугикаючи або гудячи в неї.',
    link: 'Kazoo'
  },
  {
    word: 'Мембрана',
    meaning: 'Це тонка, гнучка плівка, яка встановлюється в спеціальний отвір на корпусі інструмента. Основна функція мембрани – вібрувати у відповідь на звукові хвилі, які створює музикант, мугикаючи або гудячи в мундштук казу.',
    link: 'Kazoo'
  },
  {
    word: 'Аерофон',
    meaning: 'Це одна з основних класифікацій музичних інструментів, які виробляють звук за допомогою коливання повітря. Термін "аерофон" походить від грецького слова "aero" (повітря) і "phone" (звук). Основна ідея полягає в тому, що звук виробляється через рух повітря, яке пройшло через інструмент',
    link: 'Kazoo'
  },
  {
    word: 'Мезоамериканська культура',
    meaning: 'Це комплекс культурних традицій, що існував у центральній та південній частині Північної Америки, включаючи ацтеків, майї та інші цивілізації',
    link: 'Ocarina'
  },
  {
    word: 'Саундтреки',
    meaning: 'Музичні композиції, створені для фільмів або відеоігор, які можуть включати музику, виконану на окарині або інших інструментах.',
    link: 'Ocarina'
  },
  {
    word: 'Фольклор',
    meaning: 'Фольклор - це сукупність усної та писемної традиції, яка передається від покоління до покоління в межах певної культури або спільноти. Це може включати такі елементи, як казки, легенди, міфи, пісні, танці, народні обряди, обрядові пісні, приказки, епоси, танці, ремесла та інше. Фольклор відображає життя, традиції, вірування та цінності певної культури і часто має значний культурний, історичний і соціальний контекст. Він може бути джерелом вдячності, навчання, розваг та ідентичності для спільноти, яка його обробляє та зберігає.',
    link: 'Ocarina'
  },
  {
    word: 'Гриф',
    meaning: 'Частина струнних музичних інструментів, на якій натягнуті струни і на якій музикант притискає струни пальцями для зміни висоти звуку.',
    link: 'PikassoGuitar'
  },
  {
    word: 'Струна',
    meaning: 'Довгий, тонкий, натягнутий матеріал, зазвичай з металу або нейлону, який вібрує для створення звуку в струнних музичних інструментах.',
    link: 'PikassoGuitar'
  },
  {
    word: 'Обертони',
    meaning: 'Гармонійні складові звукової хвилі, які визначають тембр і характер звуку, що виникає при одночасному коливанні основної частоти і її кратних частот.',
    link: 'JewHarp'
  },
  {
    word: 'Тони',
    meaning: 'Звукові хвилі певної частоти, які визначають висоту звуку і його музичну інтерпретацію.',
    link: 'Hydraulophone'
  },
  {
    word: 'Синтезатор',
    meaning: 'Електронний музичний інструмент, який генерує звуки за допомогою електронних осциляторів і фільтрів, часто з можливістю імітувати звуки інших інструментів.',
    link: 'Otamatone'
  },
  {
    word: 'Нота',
    meaning: 'Символ, який використовується в музичній нотації для позначення висоти і тривалості звуку.',
    link: 'Otamatone'
  },
  {
    word: 'Тембр',
    meaning: 'Характеристичний колір або якість звуку, який дозволяє відрізняти звуки однакової висоти і гучності, але різних джерел.',
    link: 'Otamatone'
  },
  {
    word: 'Звукові частоти',
    meaning: 'Частота звукових хвиль, вимірюється в герцах (Гц) і визначає висоту звуку.',
    link: 'Theremin'
  }
];

export default glossaryData;




